### T1003.006 - OS Credential Dumping: DCSync

#### DESCRIPTION

Detects Mimikatz DC sync activity

**Example:**

> "mimikatz.exe" "lsadump::dcsync /domain:somedomain.gov.au /user:someusername.gov.au" exit

**Related**\
mimikatz

**Reference:**\
https://github.com/SigmaHQ/sigma/blob/0bd067ce9b767737155e3fb6c45a330d943d4820/rules/windows/builtin/security/win_security_dcsync.yml#L4%5C
https://www.sentinelone.com/blog/active-directory-dcsync-attacks/

#### ATT&CK TACTICS

{{mitre("T1003.006")}}

Data Source(s): [Active Directory](https://attack.mitre.org/datasources/DS0026/)

#### SENTINEL RULE QUERY

```
let selection_properties = dynamic(['Replicating Directory Changes All','1131f6ad-9c07-11d1-f79f-00c04fc2dcd2','1131f6aa-9c07-11d1-f79f-00c04fc2dcd2','9923a32a-3607-11d2-b9be-0000f87a36b2','89e95b76-444d-4c62-991a-0facbeda640c']);
let selection_AccessMask = '0x100';
let filter1 = 'Window Manager';
let filter2 = @"^(NT AUT|MSOL_)";
let filter3 = "$";
SecurityEvent
| where EventID == 4662
| where Properties has_any (selection_properties) and AccessMask == selection_AccessMask
| where not(SubjectDomainName == filter1 or SubjectUserName matches regex filter2 or SubjectUserName endswith filter3)
//| summarize first_TimeStamp=min(TimeGenerated), last_TimeStamp=max(TimeGenerated), count(), set_SubjectDomainNAme = make_set(SubjectDomainName), set_SubjectUserName = make_set(SubjectUserName), set_Properties=make_set(Properties) by Account, Computer, TenantId
```

#### Triage

1. Remove the comment "//" in 'summarize' statement in above KQL to assist in analysis and removing data duplicates.
1. Evaluate the Account and SubjectUserName, check if DC Sync expected and approved.

#### FalsePositive

1. Valid DC Sync that is not covered by the filters; please report
1. Local Domain Admin account used for Azure AD Connect

#### VERSION

Version 2.1 (date: 08/11/2023)
