### T1543.003 - Create or Modify System Process - Remote Access Tool Services Have Been Installed 
  

####  DESCRIPTION  
Detects service installation of different remote access tools software. These software are often abused by threat actors.

**Related** 
Ransomware        

**Reference:**  
https://github.com/SigmaHQ/sigma/blob/8dc32d6dffe89f014912dea9719e6a95577a6725/rules/windows/builtin/security/win_security_service_install_remote_access_software.yml#L11 


####  ATT&CK TACTICS    
{{mitre("T1543.003")}}    

Data Source(s): 
[File](https://attack.mitre.org/datasources/DS0022/), [Windows Registry](https://attack.mitre.org/datasources/DS0024), [Process](https://attack.mitre.org/datasources/DS0009/), [Application Log](https://attack.mitre.org/datasources/DS0015/)  


#### SENTINEL RULE QUERY   

~~~
let selection=dynamic(['AmmyyAdmin','Atera','BASupportExpressSrvcUpdater','BASupportExpressStandaloneService','chromoting', 'GoToAssist','GoToMyPC','jumpcloud','LMIGuardianSvc','LogMeIn','monblanking','Parsec','RManService','RPCPerformanceService','RPCService','SplashtopRemoteService','SSUService','TightVNC','vncserver','Zoho']);
union 
(
SecurityEvent
| where EventID == 4697
| where ServiceFileName has_any (selection)
| extend TableName_ = "SecurityEvent"
| summarize count(), set_Tables=make_set(TableName_) by FileName=ServiceFileName, TenantId
),
(
union withsource=TableName_ Device*
| where FileName has_any (selection)
| where FileName endswith ".exe"
| summarize count(), set_Tables=make_set(TableName_) by FileName, TenantId
)
~~~


#### Triage  

1. Inspect if the existence of the tools were expected and approved. It may be performed by an admin or a service  

#### FalsePositive
1. The rule doesn't look for anything suspicious so false positives are expected. If you use one of the tools mentioned, comment it out  

#### VERSION  
Version 1.0 (date: 06/10/2023)  