###  T1543.003 - New Service Creation Using PowerShell

####  DESCRIPTION  
Detects the creation of a new service using powershell

**Example:**  
> New-Service -Name "#{service_name}" -BinaryPathName "#{binary_path}"

**Reference:**  
https://github.com/SigmaHQ/sigma/blob/8dc32d6dffe89f014912dea9719e6a95577a6725/rules/windows/process_creation/proc_creation_win_powershell_create_service.yml#L9
https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1543.003/T1543.003.md#atomic-test-3---service-installation-powershell


**Related**  


####  ATT&CK TACTICS<br>
{{mitre("T1543.003")}} 

Data Source(s): [Process](https://attack.mitre.org/datasources/DS0009/)

#### SENTINEL RULE QUERY<br>

~~~
DeviceProcessEvents
| where ProcessCommandLine has_all ('New-Service','-BinaryPathName')
~~~

#### Triage
1. Evaluate the name of the service installed, as well as the folder location
2. Verify with user executing the commandline.

### False Positives
1. Legitimate administrator or user creates a service for legitimate reasons.
2. Software installation

#### VERSION
Version 1.0 (date: 26/10/2023)