### T1558.003 - Steal or Forge Kerberos Tickets: Kerberoasting     

####  DESCRIPTION  
Detects service ticket requests using RC4 encryption type   
  
**example:**   


**Related**  


**Reference:**  
https://github.com/SigmaHQ/sigma/blob/0bd067ce9b767737155e3fb6c45a330d943d4820/rules/windows/builtin/security/win_security_susp_rc4_kerberos.yml#L13   
https://adsecurity.org/?p=3458   
https://www.trimarcsecurity.com/single-post/TrimarcResearch/Detecting-Kerberoasting-Activity   

####  ATT&CK TACTICS<br>
T1558.003   

Data Source(s): [Security Events](https://attack.mitre.org/datasources/DS0026/)  

#### SENTINEL RULE QUERY<br>

~~~
SecurityEvent 
    | where EventID == 4769 
    | parse EventData with * 'ServiceName">' ServiceName "<" * 
    | where ServiceName contains "pick"
~~~

#### Triage

1. Inspect if the activity is expected and approved.   

#### FalsePositive  
Unknown 

#### VERSION
Version 0.1 (date: 10/07/2023)
