### T1562.002 Impair Defenses: Disable Windows Logging using wevtutil

#### DESCRIPTION

Detects Log Clear events and commandlets that can be used to disable logging using wevtutil

**Example:**\
wevtutil cl Application  // Clear all of the events from the Application\
wevtutil /e:false	// Disables a log

**Related** \
Ransomware

**Reference:**\
https://www.microsoft.com/en-us/security/blog/2021/01/20/deep-dive-into-the-solorigate-second-stage-activation-from-sunburst-to-teardrop-and-raindrop/\
https://github.com/Azure/Azure-Sentinel/blob/c6dce9c3aa4d4b4d02423ac4eb5a6b677a39e432/Hunting%20Queries/Microsoft%20365%20Defender/Ransomware/Clearing%20of%20forensic%20evidence%20from%20event%20logs%20using%20wevtutil.yaml

#### ATT&CK TACTICS

{{ mitre("T1562.002")}}

Data Source(s):
[Process](https://attack.mitre.org/datasources/DS0009/)

#### SENTINEL RULE QUERY

```
let selection_wevtutil = dynamic(["/e:false", "cl", "clear-log"]);
DeviceProcessEvents
| where ProcessCommandLine has "WEVTUTIL" and ProcessCommandLine has_any(selection_wevtutil)
//| summarize count(), first_seen = min(TimeGenerated), last_seen = max(TimeGenerated) by TenantId, DeviceName, AccountName, InitiatingProcessFolderPath, FolderPath, ProcessCommandLine
```

#### Triage

1. Inspect if the activities were expected and approved.

#### FalsePositive

1. Legitimate administrative activity

#### VERSION

Version 2.0 (date: 04/12/2023)
