### T1562.001 ImpairDefenses - Disable Defender Functionalities Via Registry Keys   
  

####  DESCRIPTION  
Detects the deletion of AMSI provider registry key entries in HKLM\Software\Microsoft\AMSI. This technique could be used by an attacker in order to disable AMSI inspection.


**example:**  
Remove-Item -Path "HKLM:\SOFTWARE\Microsoft\AMSI\Providers\{2781761E-28E0-4109-99FE-B9D127C57AFE}" -Recurse    


**Related**  
Ransomware        


**Reference:**  
https://github.com/SigmaHQ/sigma/blob/8d28609c041867e1cea7821900e43c0106e6c766/rules/windows/registry/registry_delete/registry_delete_removal_amsi_registry_key.yml    
https://github.com/SigmaHQ/sigma/blob/8d28609c041867e1cea7821900e43c0106e6c766/rules/windows/registry/registry_set/registry_set_windows_defender_tamper.yml#L42    


####  ATT&CK TACTICS    
{{ mitre("T1562.001")}}    

Data Source(s): [Windows Registry](https://attack.mitre.org/datasources/DS0024)  


#### SENTINEL RULE QUERY   

~~~
let c1=dynamic(['{2781761E-28E0-4109-99FE-B9D127C57AFE}', '{A7C452EF-8E9F-42EB-9F2B-245613CA0DC9}']);
let c2=dynamic(['DisableRealtimeMonitoring','DisableAntiVirus','DisableIOAVProtection']); 
DeviceRegistryEvents
| where (RegistryKey has_any (c1) and ActionType == 'RegistryKeyDeleted') or
(RegistryValueName has_any (c2) and RegistryValueData == 1 )
~~~


#### Triage  

1. Inspect if the activity is expected and approved. It may be performed by an admin or a service  

#### FalsePositive
As part of group policy to disable and enable defender  

#### VERSION  
Version 1.0 (date: 10/07/2023)  
